src/rust/pattern_match.org
#+TITLE: 枚举和模式
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/main.css" />
#+HTML_LINK_UP: struct.html   
#+HTML_LINK_HOME: rust.html
#+OPTIONS: num:nil timestamp:nil ^:nil

本章介绍 *枚举* ，也被称作 _enums_ 。枚举允许通过列举 _可能的成员_ 来定义一个类型：
1. 定义并使用一个枚举来展示它是如何连同数据一起编码信息的
2. 探索一个特别有用的枚举 Option: 它代表一个值要么是某个值要么什么都不是
3. 在 match 表达式中用模式匹配，针对不同的枚举值编写相应要执行的代码
4. 介绍 if let，另一个简洁方便处理代码中枚举的结构

#+BEGIN_EXAMPLE
  枚举是一个很多语言都有的功能，不过不同语言中其功能各不相同

  Rust 的枚举与 F#、OCaml 和 Haskell 这样的函数式编程语言中的”代数数据类型“最为相似
#+END_EXAMPLE
* 枚举
  #+BEGIN_EXAMPLE
    首先看一个需要诉诸于代码的场景，来考虑为何此时使用枚举更为合适且实用

    假设我们要处理 IP 地址。目前被广泛使用的两个主要 IP 标准：IPv4 和 IPv6
    这是我们的程序可能会遇到的所有可能的 IP 地址类型：所以可以 枚举 出所有可能的值，这也正是此枚举名字的由来

    任何一个 IP 地址要么是 IPv4 的要么是 IPv6 的，而且不能两者都是

    IP 地址的这个特性使得枚举数据结构非常适合这个场景，因为枚举值只可能是其中一个成员
    IPv4 和 IPv6 从根本上讲仍是 IP 地址，所以当代码在处理适用于任何类型的 IP 地址的场景时应该把它们当作相同的类型
  #+END_EXAMPLE

  通过在代码中定义一个 _IpAddrKind_ *枚举* 来表现这个概念并列出可能的 IP 地址类型， _V4_ 和 _V6_ 。这被称为枚举的 *成员* ：

  #+BEGIN_SRC rust 
  enum IpAddrKind {
      V4,
      V6,
  }
  #+END_SRC

  现在 IpAddrKind 就是一个可以在代码中使用的 *自定义数据类型* 了
