html/rust/pattern_match.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>枚举和模式</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="struct.html"> UP </a>
 |
 <a accesskey="H" href="rust.html"> HOME </a>
</div><div id="content">
<h1 class="title">枚举和模式</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf0f4c5f">枚举</a>
<ul>
<li><a href="#org8f16a9f">枚举值</a></li>
<li><a href="#orgeea1f1e">Option 枚举</a></li>
</ul>
</li>
<li><a href="#org3fac8d7">match 表达式</a>
<ul>
<li><a href="#orge6a2ddb">绑定值的模式</a></li>
<li><a href="#org781e43f">匹配 Option&lt;T&gt;</a>
<ul>
<li><a href="#org36ed41e">匹配 Some(T)</a></li>
<li><a href="#org21fd1df">匹配是穷尽的</a></li>
</ul>
</li>
<li><a href="#org5c01a82">通配符</a></li>
</ul>
</li>
<li><a href="#org3e62c84">if let</a></li>
<li><a href="#org9dd4e1e">总结</a></li>
</ul>
</div>
</div>
<p>
本章介绍 <b>枚举</b> ，也被称作 <span class="underline">enums</span> 。枚举允许通过列举 <span class="underline">可能的成员</span> 来定义一个类型：
</p>
<ol class="org-ol">
<li>定义并使用一个枚举来展示它是如何连同数据一起编码信息的</li>
<li>探索一个特别有用的枚举 Option: 它代表一个值要么是某个值要么什么都不是</li>
<li>在 match 表达式中用模式匹配，针对不同的枚举值编写相应要执行的代码</li>
<li>介绍 if let，另一个简洁方便处理代码中枚举的结构</li>
</ol>

<pre class="example">
枚举是一个很多语言都有的功能，不过不同语言中其功能各不相同

Rust 的枚举与 F#、OCaml 和 Haskell 这样的函数式编程语言中的”代数数据类型“最为相似
</pre>
<div id="outline-container-orgf0f4c5f" class="outline-2">
<h2 id="orgf0f4c5f">枚举</h2>
<div class="outline-text-2" id="text-orgf0f4c5f">
<pre class="example">
首先看一个需要诉诸于代码的场景，来考虑为何此时使用枚举更为合适且实用

假设我们要处理 IP 地址。目前被广泛使用的两个主要 IP 标准：IPv4 和 IPv6
这是我们的程序可能会遇到的所有可能的 IP 地址类型：所以可以 枚举 出所有可能的值，这也正是此枚举名字的由来

任何一个 IP 地址要么是 IPv4 的要么是 IPv6 的，而且不能两者都是

IP 地址的这个特性使得枚举数据结构非常适合这个场景，因为枚举值只可能是其中一个成员
IPv4 和 IPv6 从根本上讲仍是 IP 地址，所以当代码在处理适用于任何类型的 IP 地址的场景时应该把它们当作相同的类型
</pre>

<p>
通过在代码中定义一个 <span class="underline">IpAddrKind</span> <b>枚举</b> 来表现这个概念并列出可能的 IP 地址类型， <span class="underline">V4</span> 和 <span class="underline">V6</span> 。这被称为枚举的 <b>成员</b> ：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">IpAddrKind</span> {
    <span style="color: #98f5ff;">V4</span>,
    <span style="color: #98f5ff;">V6</span>,
}
</pre>
</div>

<p>
现在 IpAddrKind 就是一个可以在代码中使用的 <b>自定义数据类型</b> 了
</p>
</div>
