src/rust/pattern_match.org
** 枚举值
   可以像这样 *创建* IpAddrKind 两个不同成员的 *实例* ： 
   #+BEGIN_SRC rust 
  let four = IpAddrKind::V4;
  let six = IpAddrKind::V6;
   #+END_SRC

   注意：枚举的 _成员_ 位于其 _标识符的命名空间_ 中，并使用 *两个冒号* 分开

   #+BEGIN_EXAMPLE
     这么设计的益处是现在 IpAddrKind::V4 和 IpAddrKind::V6 都是 IpAddrKind 类型的
   #+END_EXAMPLE

   接着可以定义一个 _函数_ 来 *获取任何 IpAddrKind* ：

   #+BEGIN_SRC rust 
  fn route(ip_type: IpAddrKind) { }
   #+END_SRC

   现在可以使用任一成员来调用这个函数：

   #+BEGIN_SRC rust 
  route(IpAddrKind::V4);
  route(IpAddrKind::V6);
   #+END_SRC

   #+BEGIN_EXAMPLE
     进一步考虑一下 IP 地址类型，目前没有一个存储实际 IP 地址 数据 的方法：只知道它是什么 类型 的
   #+END_EXAMPLE
   考虑到已经学习过结构体了，可能会像下面那样处理这个问题：

   #+BEGIN_SRC rust 
  enum IpAddrKind {
      V4,
      V6,
  }

  struct IpAddr {
      kind: IpAddrKind,
      address: String,
  }

  let home = IpAddr {
      kind: IpAddrKind::V4,
      address: String::from("127.0.0.1"),
  };

  let loopback = IpAddr {
      kind: IpAddrKind::V6,
      address: String::from("::1"),
  };
   #+END_SRC

   #+BEGIN_EXAMPLE
     这里定义了一个有两个字段的结构体 IpAddr：
     1. IpAddrKind（之前定义的枚举）类型的 kind 字段
     2. String 类型 address 字段

     同时有这个结构体的两个实例：
     1. home：它的 kind 的值是 IpAddrKind::V4 与之相关联的地址数据是 127.0.0.1
     2. loopback：kind 的值是 IpAddrKind 的另一个成员，V6，关联的地址是 ::1

     这里使用了一个结构体来将 kind 和 address 打包在一起，现在枚举成员就与值相关联了
   #+END_EXAMPLE

   可以使用一种更简洁的方式来表达相同的概念，仅仅使用枚举并 *将 _数据_ 直接放进每一个枚举成员* 而不是将枚举作为结构体的一部分。IpAddr 枚举的新定义表明了 V4 和 V6 成员都关联了 String 值：
   #+BEGIN_SRC rust 
  enum IpAddr {
      V4(String),
      V6(String),
  }

  let home = IpAddr::V4(String::from("127.0.0.1"));

  let loopback = IpAddr::V6(String::from("::1"));
   #+END_SRC

   #+BEGIN_EXAMPLE
     直接将数据附加到枚举的每个成员上，这样就不需要一个额外的结构体了
   #+END_EXAMPLE

   用枚举替代结构体还有另一个优势： _每个成员_ 可以处理 *不同类型和数量* 的数据

   #+BEGIN_EXAMPLE
     IPv4 版本的 IP 地址总是含有四个值在 0 和 255 之间的数字部分

     如果我们想要将 V4 地址存储为四个 u8 值而 V6 地址仍然表现为一个 String，这就不能使用结构体了
   #+END_EXAMPLE

   枚举则可以轻易处理的这个情况：
   #+BEGIN_SRC rust 
  enum IpAddr {
      V4(u8, u8, u8, u8),
      V6(String),
  }

  let home = IpAddr::V4(127, 0, 0, 1);

  let loopback = IpAddr::V6(String::from("::1"));
   #+END_SRC

   #+BEGIN_EXAMPLE
     这些代码展示了使用枚举来存储两种不同 IP 地址的几种可能的选择

     然而，标准库提供了一个开箱即用的定义
   #+END_EXAMPLE

   标准库定义 IpAddr ：
   + 它正有着跟我们定义和使用的一样的枚举和成员
   + 不过它将 _成员中的地址数据_ *嵌入* 到了两个 _不同形式的结构体_ 中，它们对不同的成员的定义是不同的：

   #+BEGIN_SRC rust 
  struct Ipv4Addr {
      // --snip--
  }

  struct Ipv6Addr {
      // --snip--
  }

  enum IpAddr {
      V4(Ipv4Addr),
      V6(Ipv6Addr),
  }
   #+END_SRC

   #+BEGIN_EXAMPLE
     这些代码展示了可以将任意类型的数据放入枚举成员中：例如字符串、数字类型或者结构体。甚至可以包含另一个枚举！

     另外，标准库中的类型通常并不比你设想出来的要复杂多少

     注意：虽然标准库中包含一个 IpAddr 的定义，仍然可以创建和使用自己的定义而不会有冲突
     这是因为并没有将标准库中的定义引入作用域
   #+END_EXAMPLE

   来看看另一个枚举的例子：它的成员中内嵌了多种多样的类型：

   #+BEGIN_SRC rust 
  enum Message {
      Quit,
      Move { x: i32, y: i32 },
      Write(String),
      ChangeColor(i32, i32, i32),
  }
   #+END_SRC

   这个枚举有四个含有不同类型的成员：
   + Quit：没有关联任何数据
   + Move:  包含一个 _匿名结构体_
   + Write:  包含 _单独一个 String_
   + ChangeColor: 包含 _三个 i32_ 

   #+BEGIN_EXAMPLE
     定义一个这样的有关联值的枚举的方式和定义多个不同类型的结构体的方式很相像

     除了枚举不使用 struct 关键字以及其所有成员都被组合在一起位于 Message 类型中
   #+END_EXAMPLE

   下面这些结构体可以包含与之前枚举成员中相同的数据：
   #+BEGIN_SRC rust 
  struct QuitMessage; // 类单元结构体
  struct MoveMessage {
      x: i32,
      y: i32,
  }
  struct WriteMessage(String); // 元组结构体
  struct ChangeColorMessage(i32, i32, i32); // 元组结构体
   #+END_SRC

   #+BEGIN_EXAMPLE
     不过，如果使用不同的结构体，则它们都有不同的类型，

     这样就不能轻易地定义一个能够“处理这些不同类型的结构体”的函数，反之枚举就可以
   #+END_EXAMPLE

   结构体和枚举还有另一个相似点：可以使用 _impl_ 来为结构体定义方法那样，也可以在 *枚举上定义方法* 。这是一个定义在 Message 枚举上的叫做 _call_ 的方法：

   #+BEGIN_SRC rust 
  impl Message {
      fn call(&self) {
	  // 在这里定义方法体
      }
  }

  let m = Message::Write(String::from("hello"));
  m.call();
   #+END_SRC

   方法体使用了 _self_ 来获取调用方法的值：
   + 创建了一个值为  _Message::Write(String::from("hello"))_ 的变量 _m_
   + _m_ 就是当 m.call() 运行时 call 方法中的 _self_ 的值

   #+BEGIN_EXAMPLE
     现在来看看标准库中的另一个非常常见且实用的枚举：Option
   #+END_EXAMPLE
