html/rust/pattern_match.html
<div id="outline-container-org8f16a9f" class="outline-3">
<h3 id="org8f16a9f">枚举值</h3>
<div class="outline-text-3" id="text-org8f16a9f">
<p>
可以像这样 <b>创建</b> IpAddrKind 两个不同成员的 <b>实例</b> ： 
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">four</span> = <span style="color: #98f5ff;">IpAddrKind</span>::<span style="color: #98f5ff;">V4</span>;
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">six</span> = <span style="color: #98f5ff;">IpAddrKind</span>::<span style="color: #98f5ff;">V6</span>;
</pre>
</div>

<p>
注意：枚举的 <span class="underline">成员</span> 位于其 <span class="underline">标识符的命名空间</span> 中，并使用 <b>两个冒号</b> 分开
</p>

<pre class="example">
     这么设计的益处是现在 IpAddrKind::V4 和 IpAddrKind::V6 都是 IpAddrKind 类型的
</pre>

<p>
接着可以定义一个 <span class="underline">函数</span> 来 <b>获取任何 IpAddrKind</b> ：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">route</span>(<span style="color: #4eee94;">ip_type</span>: <span style="color: #98f5ff;">IpAddrKind</span>) { }
</pre>
</div>

<p>
现在可以使用任一成员来调用这个函数：
</p>

<div class="org-src-container">
<pre class="src src-rust">route(<span style="color: #98f5ff;">IpAddrKind</span>::<span style="color: #98f5ff;">V4</span>);
route(<span style="color: #98f5ff;">IpAddrKind</span>::<span style="color: #98f5ff;">V6</span>);
</pre>
</div>

<pre class="example">
     进一步考虑一下 IP 地址类型，目前没有一个存储实际 IP 地址 数据 的方法：只知道它是什么 类型 的
</pre>
<p>
考虑到已经学习过结构体了，可能会像下面那样处理这个问题：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">IpAddrKind</span> {
    <span style="color: #98f5ff;">V4</span>,
    <span style="color: #98f5ff;">V6</span>,
}

<span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">IpAddr</span> {
    <span style="color: #4eee94;">kind</span>: <span style="color: #98f5ff;">IpAddrKind</span>,
    <span style="color: #4eee94;">address</span>: <span style="color: #98f5ff;">String</span>,
}

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">home</span> = <span style="color: #98f5ff;">IpAddr</span> {
    <span style="color: #4eee94;">kind</span>: <span style="color: #98f5ff;">IpAddrKind</span>::<span style="color: #98f5ff;">V4</span>,
    <span style="color: #4eee94;">address</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"127.0.0.1"</span>),
};

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">loopback</span> = <span style="color: #98f5ff;">IpAddr</span> {
    <span style="color: #4eee94;">kind</span>: <span style="color: #98f5ff;">IpAddrKind</span>::<span style="color: #98f5ff;">V6</span>,
    <span style="color: #4eee94;">address</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"::1"</span>),
};
</pre>
</div>

<pre class="example">
这里定义了一个有两个字段的结构体 IpAddr：
1. IpAddrKind（之前定义的枚举）类型的 kind 字段
2. String 类型 address 字段

同时有这个结构体的两个实例：
1. home：它的 kind 的值是 IpAddrKind::V4 与之相关联的地址数据是 127.0.0.1
2. loopback：kind 的值是 IpAddrKind 的另一个成员，V6，关联的地址是 ::1

这里使用了一个结构体来将 kind 和 address 打包在一起，现在枚举成员就与值相关联了
</pre>

<p>
可以使用一种更简洁的方式来表达相同的概念，仅仅使用枚举并 <b>将 <span class="underline">数据</span> 直接放进每一个枚举成员</b> 而不是将枚举作为结构体的一部分。IpAddr 枚举的新定义表明了 V4 和 V6 成员都关联了 String 值：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">IpAddr</span> {
    <span style="color: #98f5ff;">V4</span>(<span style="color: #98f5ff;">String</span>),
    <span style="color: #98f5ff;">V6</span>(<span style="color: #98f5ff;">String</span>),
}

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">home</span> = <span style="color: #98f5ff;">IpAddr</span>::<span style="color: #98f5ff;">V4</span>(<span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"127.0.0.1"</span>));

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">loopback</span> = <span style="color: #98f5ff;">IpAddr</span>::<span style="color: #98f5ff;">V6</span>(<span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"::1"</span>));
</pre>
</div>

<pre class="example">
     直接将数据附加到枚举的每个成员上，这样就不需要一个额外的结构体了
</pre>

<p>
用枚举替代结构体还有另一个优势： <span class="underline">每个成员</span> 可以处理 <b>不同类型和数量</b> 的数据
</p>

<pre class="example">
IPv4 版本的 IP 地址总是含有四个值在 0 和 255 之间的数字部分

如果我们想要将 V4 地址存储为四个 u8 值而 V6 地址仍然表现为一个 String，这就不能使用结构体了
</pre>

<p>
枚举则可以轻易处理的这个情况：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">IpAddr</span> {
    <span style="color: #98f5ff;">V4</span>(<span style="color: #98f5ff;">u8</span>, <span style="color: #98f5ff;">u8</span>, <span style="color: #98f5ff;">u8</span>, <span style="color: #98f5ff;">u8</span>),
    <span style="color: #98f5ff;">V6</span>(<span style="color: #98f5ff;">String</span>),
}

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">home</span> = <span style="color: #98f5ff;">IpAddr</span>::<span style="color: #98f5ff;">V4</span>(127, 0, 0, 1);

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">loopback</span> = <span style="color: #98f5ff;">IpAddr</span>::<span style="color: #98f5ff;">V6</span>(<span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"::1"</span>));
</pre>
</div>

<pre class="example">
     这些代码展示了使用枚举来存储两种不同 IP 地址的几种可能的选择

     然而，标准库提供了一个开箱即用的定义
</pre>

<p>
标准库定义 IpAddr ：
</p>
<ul class="org-ul">
<li>它正有着跟我们定义和使用的一样的枚举和成员</li>
<li>不过它将 <span class="underline">成员中的地址数据</span> <b>嵌入</b> 到了两个 <span class="underline">不同形式的结构体</span> 中，它们对不同的成员的定义是不同的：</li>
</ul>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">Ipv4Addr</span> {
    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">--snip--</span>
}

<span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">Ipv6Addr</span> {
    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">--snip--</span>
}

<span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">IpAddr</span> {
    <span style="color: #98f5ff;">V4</span>(<span style="color: #98f5ff;">Ipv4Addr</span>),
    <span style="color: #98f5ff;">V6</span>(<span style="color: #98f5ff;">Ipv6Addr</span>),
}
</pre>
</div>

<pre class="example">
     这些代码展示了可以将任意类型的数据放入枚举成员中：例如字符串、数字类型或者结构体。甚至可以包含另一个枚举！

     另外，标准库中的类型通常并不比你设想出来的要复杂多少

     注意：虽然标准库中包含一个 IpAddr 的定义，仍然可以创建和使用自己的定义而不会有冲突
     这是因为并没有将标准库中的定义引入作用域
</pre>

<p>
来看看另一个枚举的例子：它的成员中内嵌了多种多样的类型：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">Message</span> {
    <span style="color: #98f5ff;">Quit</span>,
    <span style="color: #98f5ff;">Move</span> { <span style="color: #4eee94;">x</span>: <span style="color: #98f5ff;">i32</span>, <span style="color: #4eee94;">y</span>: <span style="color: #98f5ff;">i32</span> },
    <span style="color: #98f5ff;">Write</span>(<span style="color: #98f5ff;">String</span>),
    <span style="color: #98f5ff;">ChangeColor</span>(<span style="color: #98f5ff;">i32</span>, <span style="color: #98f5ff;">i32</span>, <span style="color: #98f5ff;">i32</span>),
}
</pre>
</div>

<p>
这个枚举有四个含有不同类型的成员：
</p>
<ul class="org-ul">
<li>Quit：没有关联任何数据</li>
<li>Move:  包含一个 <span class="underline">匿名结构体</span></li>
<li>Write:  包含 <span class="underline">单独一个 String</span></li>
<li>ChangeColor: 包含 <span class="underline">三个 i32</span></li>
</ul>

<pre class="example">
     定义一个这样的有关联值的枚举的方式和定义多个不同类型的结构体的方式很相像

     除了枚举不使用 struct 关键字以及其所有成员都被组合在一起位于 Message 类型中
</pre>

<p>
下面这些结构体可以包含与之前枚举成员中相同的数据：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">QuitMessage</span>; <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#31867;&#21333;&#20803;&#32467;&#26500;&#20307;</span>
<span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">MoveMessage</span> {
    <span style="color: #4eee94;">x</span>: <span style="color: #98f5ff;">i32</span>,
    <span style="color: #4eee94;">y</span>: <span style="color: #98f5ff;">i32</span>,
}
<span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">WriteMessage</span>(<span style="color: #98f5ff;">String</span>); <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#20803;&#32452;&#32467;&#26500;&#20307;</span>
<span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">ChangeColorMessage</span>(<span style="color: #98f5ff;">i32</span>, <span style="color: #98f5ff;">i32</span>, <span style="color: #98f5ff;">i32</span>); <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#20803;&#32452;&#32467;&#26500;&#20307;</span>
</pre>
</div>

<pre class="example">
     不过，如果使用不同的结构体，则它们都有不同的类型，

     这样就不能轻易地定义一个能够“处理这些不同类型的结构体”的函数，反之枚举就可以
</pre>

<p>
结构体和枚举还有另一个相似点：可以使用 <span class="underline">impl</span> 来为结构体定义方法那样，也可以在 <b>枚举上定义方法</b> 。这是一个定义在 Message 枚举上的叫做 <span class="underline">call</span> 的方法：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">impl</span> <span style="color: #98f5ff;">Message</span> {
    <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">call</span>(&amp;<span style="color: #00bfff; font-weight: bold;">self</span>) {
        <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#22312;&#36825;&#37324;&#23450;&#20041;&#26041;&#27861;&#20307;</span>
    }
}

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">m</span> = <span style="color: #98f5ff;">Message</span>::<span style="color: #98f5ff;">Write</span>(<span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"hello"</span>));
m.call();
</pre>
</div>

<p>
方法体使用了 <span class="underline">self</span> 来获取调用方法的值：
</p>
<ul class="org-ul">
<li>创建了一个值为  <span class="underline">Message::Write(String::from("hello"))</span> 的变量 <span class="underline">m</span></li>
<li><span class="underline">m</span> 就是当 m.call() 运行时 call 方法中的 <span class="underline">self</span> 的值</li>
</ul>

<pre class="example">
     现在来看看标准库中的另一个非常常见且实用的枚举：Option
</pre>
</div>
</div>
