src/rust/pattern_match.org
** Option 枚举
   #+BEGIN_EXAMPLE
     在之前的部分，看到了 IpAddr 枚举如何利用 Rust 的类型系统在程序中编码更多信息而不单单是数据

     接下来分析一个 Option 的案例，Option 是标准库定义的另一个枚举
     Option 类型应用广泛因为它编码了一个非常普遍的场景，即一个值要么有值要么没值

     从类型系统的角度来表达这个概念就意味着编译器需要检查是否处理了所有应该处理的情况
     这样就可以避免在其他编程语言中非常常见的 bug
   #+END_EXAMPLE

   #+BEGIN_EXAMPLE
     编程语言的设计经常要考虑包含哪些功能，但考虑排除哪些功能也很重要

     Rust 并没有很多其他语言中有的空值(NULL)功能
   #+END_EXAMPLE
   _空值_ 是一个值，它 *代表没有值* 。在有空值的语言中，变量总是这两种状态之一： _空值_ 和 _非空值_ 

   #+BEGIN_EXAMPLE
     空值的问题在于当你尝试像一个非空值那样使用一个空值，会出现某种形式的错误

     因为空和非空的属性无处不在，非常容易出现这类错误
   #+END_EXAMPLE

   然而，空值尝试表达的概念仍然是有意义的：空值是一个 *因为某种原因目前无效或缺失的值* 

   #+BEGIN_EXAMPLE
   问题不在于概念而在于具体的实现
   #+END_EXAMPLE
   Rust 并没有空值，不过它确实拥有一个可以编码 *存在或不存在概念的枚举* 。这个枚举是 _Option<T>_ ，而且它定义于标准库中，如下:

   #+BEGIN_SRC rust 
  enum Option<T> {
      Some(T),
      None,
  }
   #+END_SRC

   #+BEGIN_EXAMPLE
     Option<T> 枚举是如此有用以至于它甚至被包含在了 prelude 之中，不需要将其显式引入作用域

     另外，它的成员也是如此，可以不需要 Option:: 前缀来直接使用 Some 和 None

     即便如此 Option<T> 也仍是常规的枚举，Some(T) 和 None 仍是 Option<T> 的成员

     <T> 语法一个泛型类型参数：意味着 Option 枚举的 Some 成员可以包含任意类型的数据
   #+END_EXAMPLE

   这里是一些包含数字类型和字符串类型 Option 值的例子：
   #+BEGIN_SRC rust 
  let some_number = Some(5);
  let some_string = Some("a string");

  let absent_number: Option<i32> = None;
   #+END_SRC

   如果使用 _None_ 而不是 Some，需要告诉 Rust Option<T> 是什么 *类型* 的，因为编译器只通过 None 值无法推断出 Some 成员保存的值的类型

   #+BEGIN_EXAMPLE
     当有一个 Some 值时，就知道存在一个值，而这个值保存在 Some 中

     当有个 None 值时，在某种意义上，它跟空值具有相同的意义：并没有一个有效的值

     那么，Option<T> 为什么就比空值要好呢？
   #+END_EXAMPLE

   简而言之，因为 _Option<T>_ 和  _T_ 是不同的类型，编译器 *不允许* 像一个 _肯定有效的值_ 那样使用 _Option<T>_ 。例如，这段代码不能编译，因为它尝试将 Option<i8> 与 i8 相加：

   #+BEGIN_SRC rust 
  let x: i8 = 5;
  let y: Option<i8> = Some(5);

  let sum = x + y;
   #+END_SRC

   如果运行这段代码，将会编译报错：

   #+BEGIN_SRC sh 
  error[E0277]: the trait bound `i8: std::ops::Add<std::option::Option<i8>>` is
  not satisfied
   -->
    |
  5 |     let sum = x + y;
    |                 ^ no implementation for `i8 + std::option::Option<i8>`
   #+END_SRC

   #+BEGIN_EXAMPLE
     错误信息意味着 Rust 不知道该如何将 Option<i8> 与 i8 相加，因为它们的类型不同

     当在 Rust 中拥有一个像 i8 这样类型的值时，编译器确保它总是有一个有效的值。可以自信使用而无需做空值检查
     只有当使用 Option<i8>（或者任何用到的类型）的时候需要担心可能没有值，而编译器会确保在使用值之前处理了为空的情况。

     换句话说，在对 Option<T> 进行 T 的运算之前必须将其转换为 T
     通常这能帮助捕获到空值最常见的问题之一：假设某值不为空但实际上为空的情况

     不再担心会错误的假设一个非空值，会对代码更加有信心：
     为了拥有一个可能为空的值，必须要显式的将其放入对应类型的 Option<T> 中，当使用这个值时，必须明确的处理值为空的情况
     只要一个值不是 Option<T> 类型，就 可以 安全的认定它的值不为空

     这是 Rust 的一个经过深思熟虑的设计决策，来限制空值的泛滥以增加 Rust 代码的安全性
   #+END_EXAMPLE

   那么当有一个 Option<T> 的值时，如何从 Some 成员中取出 T 的值来使用它呢？Option<T> 枚举拥有大量用于各种情况的方法：可以查看它的文档

   #+BEGIN_EXAMPLE
     总的来说，为了使用 Option<T> 值，需要编写处理每个成员的代码：
     1. 想要一些代码只当拥有 Some(T) 值时运行，允许这些代码使用其中的 T
     2. 也希望一些代码在值为 None 时运行，这些代码并没有一个可用的 T 值

     match 表达式就是这么一个处理枚举的控制流结构：
     它会根据枚举的成员运行不同的代码，这些代码可以使用匹配到的值中的数据
   #+END_EXAMPLE
* match 表达式
  Rust 有一个叫做 _match_ 的极为强大的 *控制流运算符* ，它允许将 _一个值_ 与 _一系列的模式_ 相比较，并根据 *相匹配的模式执行相应代码* 。模式可由：
  + 字面值
  + 变量
  + 通配符
  + 许多其他内容构成 

  match 的力量来源于模式的表现力以及编译器检查，它确保了所有可能的情况都得到处理

  #+BEGIN_EXAMPLE
    可以把 match 表达式想象成某种硬币分类器：
    硬币滑入有着不同大小孔洞的轨道，每一个硬币都会掉入符合它大小的孔洞

    同样地，值也会通过 match 的每一个模式，并且在遇到第一个 “符合” 的模式时，值会进入相关联的代码块并在执行中被使用
  #+END_EXAMPLE

  编写一个函数来获取一个未知的（美元）硬币，并以一种类似验钞机的方式，确定它是何种硬币并返回它的美分值，如下所示：

  #+BEGIN_SRC rust 
  enum Coin {
      Penny,
      Nickel,
      Dime,
      Quarter,
  }

  fn value_in_cents(coin: Coin) -> u8 {
      match coin {
	  Coin::Penny => 1,
	  Coin::Nickel => 5,
	  Coin::Dime => 10,
	  Coin::Quarter => 25,
      }
  }
  #+END_SRC

  拆开 value_in_cents 函数中的 match 来看：
  + 列出 match 关键字后跟一个表达式：例子中是 _coin 的值_ 
  #+BEGIN_EXAMPLE
    这看起来非常像 if 使用的表达式，不过这里有一个非常大的区别：
    对于 if，表达式必须返回一个布尔值，而这里它可以是任何类型的

    例子中的 coin 的类型是定义的 Coin 枚举
  #+END_EXAMPLE
  + 接下来是 match 的分支。一个分支有两个部分：一个模式和一些代码 
    + 第一个分支的模式是值 _Coin::Penny_
    + 之后的 _=>_ 运算符将模式和将要 *运行的代码* 分开：这里的代码就仅仅是值 1
      + 每个分支相关联的代码是一个表达式，而 _表达式的结果值_ 将作为 *整个 match 表达式的返回值* 
    + 每一个分支之间使用 _逗号_ 分隔 
  + 当 match 表达式执行时，它将结果值按顺序与每一个分支的模式相比较：
    + 如果模式 *匹配* 了这个值，这个模式相关联的 *代码将被执行* 
    + 如果模式并 *不匹配* 这个值，将继续 *执行下一个分支* 

  #+BEGIN_EXAMPLE
    这非常类似一个硬币分类器。可以拥有任意多的分支：示例中的 match 有四个分支
  #+END_EXAMPLE

  如果分支代码较短的话通常不使用大括号，正如上面示例中每个分支都只是返回一个值。如果想要在分支中运行多行代码，可以使用大括号： 
  #+BEGIN_SRC rust 
  fn value_in_cents(coin: Coin) -> u8 {
      match coin {
	  Coin::Penny => {
	      println!("Lucky penny!");
	      1
	  },
	  Coin::Nickel => 5,
	  Coin::Dime => 10,
	  Coin::Quarter => 25,
      }
  }
  #+END_SRC

  每次使用Coin::Penny 调用时都会打印出 “Lucky penny!”，同时仍然返回代码块最后的值 1
