html/rust/pattern_match.html
<div id="outline-container-orgeea1f1e" class="outline-3">
<h3 id="orgeea1f1e">Option 枚举</h3>
<div class="outline-text-3" id="text-orgeea1f1e">
<pre class="example">
在之前的部分，看到了 IpAddr 枚举如何利用 Rust 的类型系统在程序中编码更多信息而不单单是数据

接下来分析一个 Option 的案例，Option 是标准库定义的另一个枚举
Option 类型应用广泛因为它编码了一个非常普遍的场景，即一个值要么有值要么没值

从类型系统的角度来表达这个概念就意味着编译器需要检查是否处理了所有应该处理的情况
这样就可以避免在其他编程语言中非常常见的 bug
</pre>

<pre class="example">
编程语言的设计经常要考虑包含哪些功能，但考虑排除哪些功能也很重要

Rust 并没有很多其他语言中有的空值(NULL)功能
</pre>
<p>
<span class="underline">空值</span> 是一个值，它 <b>代表没有值</b> 。在有空值的语言中，变量总是这两种状态之一： <span class="underline">空值</span> 和 <span class="underline">非空值</span> 
</p>

<pre class="example">
     空值的问题在于当你尝试像一个非空值那样使用一个空值，会出现某种形式的错误

     因为空和非空的属性无处不在，非常容易出现这类错误
</pre>

<p>
然而，空值尝试表达的概念仍然是有意义的：空值是一个 <b>因为某种原因目前无效或缺失的值</b> 
</p>

<pre class="example">
   问题不在于概念而在于具体的实现
</pre>
<p>
Rust 并没有空值，不过它确实拥有一个可以编码 <b>存在或不存在概念的枚举</b> 。这个枚举是 <span class="underline">Option&lt;T&gt;</span> ，而且它定义于标准库中，如下:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">Option</span>&lt;<span style="color: #98f5ff;">T</span>&gt; {
    <span style="color: #98f5ff;">Some</span>(<span style="color: #98f5ff;">T</span>),
    <span style="color: #98f5ff;">None</span>,
}
</pre>
</div>

<pre class="example">
Option&lt;T&gt; 枚举是如此有用以至于它甚至被包含在了 prelude 之中，不需要将其显式引入作用域

另外，它的成员也是如此，可以不需要 Option:: 前缀来直接使用 Some 和 None

即便如此 Option&lt;T&gt; 也仍是常规的枚举，Some(T) 和 None 仍是 Option&lt;T&gt; 的成员

&lt;T&gt; 语法一个泛型类型参数：意味着 Option 枚举的 Some 成员可以包含任意类型的数据
</pre>

<p>
这里是一些包含数字类型和字符串类型 Option 值的例子：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">some_number</span> = <span style="color: #98f5ff;">Some</span>(5);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">some_string</span> = <span style="color: #98f5ff;">Some</span>(<span style="color: #deb887;">"a string"</span>);

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">absent_number</span>: <span style="color: #98f5ff;">Option</span>&lt;<span style="color: #98f5ff;">i32</span>&gt; = <span style="color: #98f5ff;">None</span>;
</pre>
</div>

<p>
如果使用 <span class="underline">None</span> 而不是 Some，需要告诉 Rust Option&lt;T&gt; 是什么 <b>类型</b> 的，因为编译器只通过 None 值无法推断出 Some 成员保存的值的类型
</p>

<pre class="example">
     当有一个 Some 值时，就知道存在一个值，而这个值保存在 Some 中

     当有个 None 值时，在某种意义上，它跟空值具有相同的意义：并没有一个有效的值

     那么，Option&lt;T&gt; 为什么就比空值要好呢？
</pre>

<p>
简而言之，因为 <span class="underline">Option&lt;T&gt;</span> 和  <span class="underline">T</span> 是不同的类型，编译器 <b>不允许</b> 像一个 <span class="underline">肯定有效的值</span> 那样使用 <span class="underline">Option&lt;T&gt;</span> 。例如，这段代码不能编译，因为它尝试将 Option&lt;i8&gt; 与 i8 相加：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">x</span>: <span style="color: #98f5ff;">i8</span> = 5;
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">y</span>: <span style="color: #98f5ff;">Option</span>&lt;<span style="color: #98f5ff;">i8</span>&gt; = <span style="color: #98f5ff;">Some</span>(5);

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">sum</span> = x + y;
</pre>
</div>

<p>
如果运行这段代码，将会编译报错：
</p>

<div class="org-src-container">
<pre class="src src-sh">error[E0277]: the trait bound <span style="color: #fa8072;">`i8: std::ops::Add&lt;std::option::Option&lt;i8&gt;&gt;`</span> is
not satisfied
 --&gt;
  |
5 |     <span style="color: #f08080;">let</span> sum = x + y;
  |                 ^ no implementation for <span style="color: #fa8072;">`i8 + std::option::Option&lt;i8&gt;`</span>
</pre>
</div>

<pre class="example">
     错误信息意味着 Rust 不知道该如何将 Option&lt;i8&gt; 与 i8 相加，因为它们的类型不同

     当在 Rust 中拥有一个像 i8 这样类型的值时，编译器确保它总是有一个有效的值。可以自信使用而无需做空值检查
     只有当使用 Option&lt;i8&gt;（或者任何用到的类型）的时候需要担心可能没有值，而编译器会确保在使用值之前处理了为空的情况。

     换句话说，在对 Option&lt;T&gt; 进行 T 的运算之前必须将其转换为 T
     通常这能帮助捕获到空值最常见的问题之一：假设某值不为空但实际上为空的情况

     不再担心会错误的假设一个非空值，会对代码更加有信心：
     为了拥有一个可能为空的值，必须要显式的将其放入对应类型的 Option&lt;T&gt; 中，当使用这个值时，必须明确的处理值为空的情况
     只要一个值不是 Option&lt;T&gt; 类型，就 可以 安全的认定它的值不为空

     这是 Rust 的一个经过深思熟虑的设计决策，来限制空值的泛滥以增加 Rust 代码的安全性
</pre>

<p>
那么当有一个 Option&lt;T&gt; 的值时，如何从 Some 成员中取出 T 的值来使用它呢？Option&lt;T&gt; 枚举拥有大量用于各种情况的方法：可以查看它的文档
</p>

<pre class="example">
总的来说，为了使用 Option&lt;T&gt; 值，需要编写处理每个成员的代码：
1. 想要一些代码只当拥有 Some(T) 值时运行，允许这些代码使用其中的 T
2. 也希望一些代码在值为 None 时运行，这些代码并没有一个可用的 T 值

match 表达式就是这么一个处理枚举的控制流结构：
它会根据枚举的成员运行不同的代码，这些代码可以使用匹配到的值中的数据
</pre>
</div>
</div>
</div>
<div id="outline-container-org3fac8d7" class="outline-2">
<h2 id="org3fac8d7">match 表达式</h2>
<div class="outline-text-2" id="text-org3fac8d7">
<p>
Rust 有一个叫做 <span class="underline">match</span> 的极为强大的 <b>控制流运算符</b> ，它允许将 <span class="underline">一个值</span> 与 <span class="underline">一系列的模式</span> 相比较，并根据 <b>相匹配的模式执行相应代码</b> 。模式可由：
</p>
<ul class="org-ul">
<li>字面值</li>
<li>变量</li>
<li>通配符</li>
<li>许多其他内容构成</li>
</ul>

<p>
match 的力量来源于模式的表现力以及编译器检查，它确保了所有可能的情况都得到处理
</p>

<pre class="example">
    可以把 match 表达式想象成某种硬币分类器：
    硬币滑入有着不同大小孔洞的轨道，每一个硬币都会掉入符合它大小的孔洞

    同样地，值也会通过 match 的每一个模式，并且在遇到第一个 “符合” 的模式时，值会进入相关联的代码块并在执行中被使用
</pre>

<p>
编写一个函数来获取一个未知的（美元）硬币，并以一种类似验钞机的方式，确定它是何种硬币并返回它的美分值，如下所示：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">Coin</span> {
    <span style="color: #98f5ff;">Penny</span>,
    <span style="color: #98f5ff;">Nickel</span>,
    <span style="color: #98f5ff;">Dime</span>,
    <span style="color: #98f5ff;">Quarter</span>,
}

<span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">value_in_cents</span>(<span style="color: #4eee94;">coin</span>: <span style="color: #98f5ff;">Coin</span>) -&gt; <span style="color: #98f5ff;">u8</span> {
    <span style="color: #00bfff; font-weight: bold;">match</span> coin {
        <span style="color: #98f5ff;">Coin</span>::<span style="color: #98f5ff;">Penny</span> =&gt; 1,
        <span style="color: #98f5ff;">Coin</span>::<span style="color: #98f5ff;">Nickel</span> =&gt; 5,
        <span style="color: #98f5ff;">Coin</span>::<span style="color: #98f5ff;">Dime</span> =&gt; 10,
        <span style="color: #98f5ff;">Coin</span>::<span style="color: #98f5ff;">Quarter</span> =&gt; 25,
    }
}
</pre>
</div>

<p>
拆开 value_in_cents 函数中的 match 来看：
</p>
<ul class="org-ul">
<li>列出 match 关键字后跟一个表达式：例子中是 <span class="underline">coin 的值</span></li>
</ul>
<pre class="example">
    这看起来非常像 if 使用的表达式，不过这里有一个非常大的区别：
    对于 if，表达式必须返回一个布尔值，而这里它可以是任何类型的

    例子中的 coin 的类型是定义的 Coin 枚举
</pre>
<ul class="org-ul">
<li>接下来是 match 的分支。一个分支有两个部分：一个模式和一些代码 
<ul class="org-ul">
<li>第一个分支的模式是值 <span class="underline">Coin::Penny</span></li>
<li>之后的 <span class="underline">=&gt;</span> 运算符将模式和将要 <b>运行的代码</b> 分开：这里的代码就仅仅是值 1
<ul class="org-ul">
<li>每个分支相关联的代码是一个表达式，而 <span class="underline">表达式的结果值</span> 将作为 <b>整个 match 表达式的返回值</b></li>
</ul></li>
<li>每一个分支之间使用 <span class="underline">逗号</span> 分隔</li>
</ul></li>
<li>当 match 表达式执行时，它将结果值按顺序与每一个分支的模式相比较：
<ul class="org-ul">
<li>如果模式 <b>匹配</b> 了这个值，这个模式相关联的 <b>代码将被执行</b></li>
<li>如果模式并 <b>不匹配</b> 这个值，将继续 <b>执行下一个分支</b></li>
</ul></li>
</ul>

<pre class="example">
    这非常类似一个硬币分类器。可以拥有任意多的分支：示例中的 match 有四个分支
</pre>

<p>
如果分支代码较短的话通常不使用大括号，正如上面示例中每个分支都只是返回一个值。如果想要在分支中运行多行代码，可以使用大括号： 
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">value_in_cents</span>(<span style="color: #4eee94;">coin</span>: <span style="color: #98f5ff;">Coin</span>) -&gt; <span style="color: #98f5ff;">u8</span> {
    <span style="color: #00bfff; font-weight: bold;">match</span> coin {
        <span style="color: #98f5ff;">Coin</span>::<span style="color: #98f5ff;">Penny</span> =&gt; {
            <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"Lucky penny!"</span>);
            1
        },
        <span style="color: #98f5ff;">Coin</span>::<span style="color: #98f5ff;">Nickel</span> =&gt; 5,
        <span style="color: #98f5ff;">Coin</span>::<span style="color: #98f5ff;">Dime</span> =&gt; 10,
        <span style="color: #98f5ff;">Coin</span>::<span style="color: #98f5ff;">Quarter</span> =&gt; 25,
    }
}
</pre>
</div>

<p>
每次使用Coin::Penny 调用时都会打印出 “Lucky penny!”，同时仍然返回代码块最后的值 1
</p>
</div>
