src/rust/pattern_match.org
** 绑定值的模式
   匹配分支的另一个有用的功能：可以 *绑定* 匹配的 _模式的部分值_ 。这也就是如何从枚举成员中提取值的

   #+BEGIN_EXAMPLE
     1999 年到 2008 年间，美国在 25 美分的硬币的一侧为 50 个州的每一个都印刷了不同的设计

     其他的硬币都没有这种区分州的设计，所以只有这些 25 美分硬币有特殊的价值
   #+END_EXAMPLE

   可以将这些信息加入 enum，通过改变 Quarter 成员来包含一个 State 值，下面中完成了这些修改：
   #+BEGIN_SRC rust 
  #[derive(Debug)] // 这样可以可以立刻看到州的名称
  enum UsState {
      Alabama,
      Alaska,
      // --snip--
  }

  enum Coin {
      Penny,
      Nickel,
      Dime,
      Quarter(UsState),
  }
   #+END_SRC

   #+BEGIN_EXAMPLE
     想象一下有一个朋友尝试收集所有 50 个州的 25 美分硬币

     在根据硬币类型分类零钱的同时，也可以报告出每个 25 美分硬币所对应的州名称。这样如果他没有的话，可以将其加入收藏
   #+END_EXAMPLE

   在匹配 _Coin::Quarter_ 成员的分支的模式中增加了一个叫做 _state_ 的变量。当匹配到 Coin::Quarter 时，变量 state 将会 *绑定* _25美分硬币所对应州的值_ 。接着在那个分支的代码中使用 state，如下：
   #+BEGIN_SRC rust 
  fn value_in_cents(coin: Coin) -> u8 {
      match coin {
	  Coin::Penny => 1,
	  Coin::Nickel => 5,
	  Coin::Dime => 10,
	  Coin::Quarter(state) => {
	      println!("State quarter from {:?}!", state);
	      25
	  },
      }
  }
   #+END_SRC

   #+BEGIN_EXAMPLE
     如果调用 value_in_cents(Coin::Quarter(UsState::Alaska))，coin 将是 Coin::Quarter(UsState::Alaska)

     当将值与每个分支相比较时，没有分支会匹配，直到遇到 Coin::Quarter(state)，这时，state 绑定的将会是值 UsState::Alaska

     接着就可以在 println! 表达式中使用这个绑定了，像这样就可以获取 Coin 枚举的 Quarter 成员中内部的州的值
   #+END_EXAMPLE
** 匹配 Option<T> 
   #+BEGIN_EXAMPLE
     在之前的部分中使用 Option<T> 时，是为了从 Some 中取出其内部的 T 值；还可以像处理 Coin 枚举那样使用 match 处理 Option<T>！

     与其直接比较硬币，将比较 Option<T> 的成员，不过 match 表达式的工作方式保持不变

     比如想要编写一个函数，它获取一个 Option<i32> 并且如果其中有一个值，将其加一。如果其中没有值，函数应该返回 None 值并不尝试执行任何操作
   #+END_EXAMPLE
   得益于 match，编写这个函数非常简单：

   #+BEGIN_SRC rust 
  fn plus_one(x: Option<i32>) -> Option<i32> {
      match x {
	  None => None,
	  Some(i) => Some(i + 1),
      }
  }

  let five = Some(5);
  let six = plus_one(five);
  let none = plus_one(None);
   #+END_SRC
*** 匹配 Some(T) 
    更仔细地检查 plus_one 的第一行操作。当调用 plus_one(five) 时，plus_one 函数体中的 x 将会是值 Some(5)。接着将其与每个分支比较：

    #+BEGIN_SRC rust 
  None => None,
    #+END_SRC

    值 Some(5) 并不匹配模式 None，所以继续进行下一个分支：

    #+BEGIN_SRC rust 
  Some(i) => Some(i + 1),
    #+END_SRC

    Some(5) 与 Some(i) 匹配吗？当然匹配！它们是相同的成员。i 绑定了 Some 中包含的值，所以 _i_ 的值是 _5_ 。接着匹配分支的代码被执行，所以将 i 的值加一并返回一个 _含有值 6 的新 Some_ 

    接着考虑 plus_one 的第二个调用，这里 x 是 None。进入 match 并与第一个分支相比较：
    #+BEGIN_SRC rust 
  None => None,
    #+END_SRC
    匹配上了！这里没有值来加一，所以程序结束并返回 => _右侧的值 None_ ，因为第一个分支就匹配到了，其他的分支将不再比较

    #+BEGIN_EXAMPLE
      将 match 与枚举相结合在很多场景中都是有用的

      会在 Rust 代码中看到很多这样的模式：match 一个枚举，绑定其中的值到一个变量，接着根据其值执行代码

      这在一开始有点复杂，不过一旦习惯了，会希望所有语言都拥有它！这一直是用户的最爱
    #+END_EXAMPLE
*** 匹配是穷尽的
    考虑一下 plus_one 函数的这个版本，它有一个 bug 并不能编译：
    #+BEGIN_SRC rust 
  fn plus_one(x: Option<i32>) -> Option<i32> {
      match x {
	  Some(i) => Some(i + 1),
      }
  }
    #+END_SRC

    因为没有处理 None 的情况，所以这些代码会造成一个 bug。幸运的是，这是一个 Rust 知道如何处理的 bug。如果尝试编译这段代码，会得到这个错误：

    #+BEGIN_SRC sh 
  error[E0004]: non-exhaustive patterns: `None` not covered
   -->
    |
  6 |         match x {
    |               ^ pattern `None` not covered
    #+END_SRC

    Rust 知道没有覆盖所有可能的情况甚至知道哪些模式被忘记了！Rust 中的匹配是 *穷尽* 的：必须穷举到最后的可能性来使代码有效

    #+BEGIN_EXAMPLE
      特别的在这个 Option<T> 的例子中，Rust 防止忘记明确的处理 None 的情况

      这使免于假设拥有一个实际上为空的值
    #+END_EXAMPLE
** 通配符
   Rust 也提供了一个模式用于 *不想列举出所有可能值* 的场景：
   #+BEGIN_EXAMPLE
     例如，u8 可以拥有 0 到 255 的有效的值，如果只关心 1、3、5 和 7 这几个值，就并不想必须列出 0、2、4、6、8、9 一直到 255 的值
   #+END_EXAMPLE
   这时候可以使用特殊的模式 *_* 替代：

   #+BEGIN_SRC rust 
  let some_u8_value = 0u8;
  match some_u8_value {
      1 => println!("one"),
      3 => println!("three"),
      5 => println!("five"),
      7 => println!("seven"),
      _ => (),
  }
   #+END_SRC

   _ 模式会匹配所有的值。通过将其放置于其他分支之后，_ 将会匹配所有之前没有指定的可能的值。() 就是 unit 值，所以 _ 的情况什么也不会发生，也不会做任何处理

   #+BEGIN_EXAMPLE
     然而，match 在只关心 一个 情况的场景中可能就有点啰嗦，所以 Rust 提供了 if let
   #+END_EXAMPLE
