html/rust/pattern_match.html
<div id="outline-container-orge6a2ddb" class="outline-3">
<h3 id="orge6a2ddb">绑定值的模式</h3>
<div class="outline-text-3" id="text-orge6a2ddb">
<p>
匹配分支的另一个有用的功能：可以 <b>绑定</b> 匹配的 <span class="underline">模式的部分值</span> 。这也就是如何从枚举成员中提取值的
</p>

<pre class="example">
1999 年到 2008 年间，美国在 25 美分的硬币的一侧为 50 个州的每一个都印刷了不同的设计

其他的硬币都没有这种区分州的设计，所以只有这些 25 美分硬币有特殊的价值
</pre>

<p>
可以将这些信息加入 enum，通过改变 Quarter 成员来包含一个 State 值，下面中完成了这些修改：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ffd700;">#[derive(Debug)]</span> <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#36825;&#26679;&#21487;&#20197;&#21487;&#20197;&#31435;&#21051;&#30475;&#21040;&#24030;&#30340;&#21517;&#31216;</span>
<span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">UsState</span> {
    <span style="color: #98f5ff;">Alabama</span>,
    <span style="color: #98f5ff;">Alaska</span>,
    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">--snip--</span>
}

<span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">Coin</span> {
    <span style="color: #98f5ff;">Penny</span>,
    <span style="color: #98f5ff;">Nickel</span>,
    <span style="color: #98f5ff;">Dime</span>,
    <span style="color: #98f5ff;">Quarter</span>(<span style="color: #98f5ff;">UsState</span>),
}
</pre>
</div>

<pre class="example">
     想象一下有一个朋友尝试收集所有 50 个州的 25 美分硬币

     在根据硬币类型分类零钱的同时，也可以报告出每个 25 美分硬币所对应的州名称。这样如果他没有的话，可以将其加入收藏
</pre>

<p>
在匹配 <span class="underline">Coin::Quarter</span> 成员的分支的模式中增加了一个叫做 <span class="underline">state</span> 的变量。当匹配到 Coin::Quarter 时，变量 state 将会 <b>绑定</b> <span class="underline">25美分硬币所对应州的值</span> 。接着在那个分支的代码中使用 state，如下：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">value_in_cents</span>(<span style="color: #4eee94;">coin</span>: <span style="color: #98f5ff;">Coin</span>) -&gt; <span style="color: #98f5ff;">u8</span> {
    <span style="color: #00bfff; font-weight: bold;">match</span> coin {
        <span style="color: #98f5ff;">Coin</span>::<span style="color: #98f5ff;">Penny</span> =&gt; 1,
        <span style="color: #98f5ff;">Coin</span>::<span style="color: #98f5ff;">Nickel</span> =&gt; 5,
        <span style="color: #98f5ff;">Coin</span>::<span style="color: #98f5ff;">Dime</span> =&gt; 10,
        <span style="color: #98f5ff;">Coin</span>::<span style="color: #98f5ff;">Quarter</span>(state) =&gt; {
            <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"State quarter from </span><span style="color: #deb887; font-style: italic;">{:?}</span><span style="color: #deb887;">!"</span>, state);
            25
        },
    }
}
</pre>
</div>

<pre class="example">
     如果调用 value_in_cents(Coin::Quarter(UsState::Alaska))，coin 将是 Coin::Quarter(UsState::Alaska)

     当将值与每个分支相比较时，没有分支会匹配，直到遇到 Coin::Quarter(state)，这时，state 绑定的将会是值 UsState::Alaska

     接着就可以在 println! 表达式中使用这个绑定了，像这样就可以获取 Coin 枚举的 Quarter 成员中内部的州的值
</pre>
</div>
</div>
<div id="outline-container-org781e43f" class="outline-3">
<h3 id="org781e43f">匹配 Option&lt;T&gt;</h3>
<div class="outline-text-3" id="text-org781e43f">
<pre class="example">
     在之前的部分中使用 Option&lt;T&gt; 时，是为了从 Some 中取出其内部的 T 值；还可以像处理 Coin 枚举那样使用 match 处理 Option&lt;T&gt;！

     与其直接比较硬币，将比较 Option&lt;T&gt; 的成员，不过 match 表达式的工作方式保持不变

     比如想要编写一个函数，它获取一个 Option&lt;i32&gt; 并且如果其中有一个值，将其加一。如果其中没有值，函数应该返回 None 值并不尝试执行任何操作
</pre>
<p>
得益于 match，编写这个函数非常简单：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">plus_one</span>(<span style="color: #4eee94;">x</span>: <span style="color: #98f5ff;">Option</span>&lt;<span style="color: #98f5ff;">i32</span>&gt;) -&gt; <span style="color: #98f5ff;">Option</span>&lt;<span style="color: #98f5ff;">i32</span>&gt; {
    <span style="color: #00bfff; font-weight: bold;">match</span> x {
        <span style="color: #98f5ff;">None</span> =&gt; <span style="color: #98f5ff;">None</span>,
        <span style="color: #98f5ff;">Some</span>(i) =&gt; <span style="color: #98f5ff;">Some</span>(i + 1),
    }
}

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">five</span> = <span style="color: #98f5ff;">Some</span>(5);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">six</span> = plus_one(five);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">none</span> = plus_one(<span style="color: #98f5ff;">None</span>);
</pre>
</div>
</div>
<div id="outline-container-org36ed41e" class="outline-4">
<h4 id="org36ed41e">匹配 Some(T)</h4>
<div class="outline-text-4" id="text-org36ed41e">
<p>
更仔细地检查 plus_one 的第一行操作。当调用 plus_one(five) 时，plus_one 函数体中的 x 将会是值 Some(5)。接着将其与每个分支比较：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #98f5ff;">None</span> =&gt; <span style="color: #98f5ff;">None</span>,
</pre>
</div>

<p>
值 Some(5) 并不匹配模式 None，所以继续进行下一个分支：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #98f5ff;">Some</span>(i) =&gt; <span style="color: #98f5ff;">Some</span>(i + 1),
</pre>
</div>

<p>
Some(5) 与 Some(i) 匹配吗？当然匹配！它们是相同的成员。i 绑定了 Some 中包含的值，所以 <span class="underline">i</span> 的值是 <span class="underline">5</span> 。接着匹配分支的代码被执行，所以将 i 的值加一并返回一个 <span class="underline">含有值 6 的新 Some</span> 
</p>

<p>
接着考虑 plus_one 的第二个调用，这里 x 是 None。进入 match 并与第一个分支相比较：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #98f5ff;">None</span> =&gt; <span style="color: #98f5ff;">None</span>,
</pre>
</div>
<p>
匹配上了！这里没有值来加一，所以程序结束并返回 =&gt; <span class="underline">右侧的值 None</span> ，因为第一个分支就匹配到了，其他的分支将不再比较
</p>

<pre class="example">
      将 match 与枚举相结合在很多场景中都是有用的

      会在 Rust 代码中看到很多这样的模式：match 一个枚举，绑定其中的值到一个变量，接着根据其值执行代码

      这在一开始有点复杂，不过一旦习惯了，会希望所有语言都拥有它！这一直是用户的最爱
</pre>
</div>
</div>
<div id="outline-container-org21fd1df" class="outline-4">
<h4 id="org21fd1df">匹配是穷尽的</h4>
<div class="outline-text-4" id="text-org21fd1df">
<p>
考虑一下 plus_one 函数的这个版本，它有一个 bug 并不能编译：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">plus_one</span>(<span style="color: #4eee94;">x</span>: <span style="color: #98f5ff;">Option</span>&lt;<span style="color: #98f5ff;">i32</span>&gt;) -&gt; <span style="color: #98f5ff;">Option</span>&lt;<span style="color: #98f5ff;">i32</span>&gt; {
    <span style="color: #00bfff; font-weight: bold;">match</span> x {
        <span style="color: #98f5ff;">Some</span>(i) =&gt; <span style="color: #98f5ff;">Some</span>(i + 1),
    }
}
</pre>
</div>

<p>
因为没有处理 None 的情况，所以这些代码会造成一个 bug。幸运的是，这是一个 Rust 知道如何处理的 bug。如果尝试编译这段代码，会得到这个错误：
</p>

<div class="org-src-container">
<pre class="src src-sh">error[E0004]: non-exhaustive patterns: <span style="color: #fa8072;">`None`</span> not covered
 --&gt;
  |
6 |         match x {
  |               ^ pattern <span style="color: #fa8072;">`None`</span> not covered
</pre>
</div>

<p>
Rust 知道没有覆盖所有可能的情况甚至知道哪些模式被忘记了！Rust 中的匹配是 <b>穷尽</b> 的：必须穷举到最后的可能性来使代码有效
</p>

<pre class="example">
      特别的在这个 Option&lt;T&gt; 的例子中，Rust 防止忘记明确的处理 None 的情况

      这使免于假设拥有一个实际上为空的值
</pre>
</div>
</div>
</div>
<div id="outline-container-org5c01a82" class="outline-3">
<h3 id="org5c01a82">通配符</h3>
<div class="outline-text-3" id="text-org5c01a82">
<p>
Rust 也提供了一个模式用于 <b>不想列举出所有可能值</b> 的场景：
</p>
<pre class="example">
     例如，u8 可以拥有 0 到 255 的有效的值，如果只关心 1、3、5 和 7 这几个值，就并不想必须列出 0、2、4、6、8、9 一直到 255 的值
</pre>
<p>
这时候可以使用特殊的模式 <b>_</b> 替代：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">some_u8_value</span> = 0u8;
<span style="color: #00bfff; font-weight: bold;">match</span> some_u8_value {
    1 =&gt; <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"one"</span>),
    3 =&gt; <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"three"</span>),
    5 =&gt; <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"five"</span>),
    7 =&gt; <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"seven"</span>),
    _ =&gt; (),
}
</pre>
</div>

<p>
_ 模式会匹配所有的值。通过将其放置于其他分支之后，_ 将会匹配所有之前没有指定的可能的值。() 就是 unit 值，所以 _ 的情况什么也不会发生，也不会做任何处理
</p>

<pre class="example">
     然而，match 在只关心 一个 情况的场景中可能就有点啰嗦，所以 Rust 提供了 if let
</pre>
</div>
</div>
</div>
